IPA_Alphabet = ['i', 'r', 'p', 'd', 'l', 'ʧ', 'ɛ', 'h', 'm', 'ə', 'ŋ', 'θ', 'k', 'o', 'ʤ', 'a', 'g', 'æ', 'u', 'f', 'e', 'ð', 'w', 'n', 'b', 'ɔ', 'j', 't', 's', 'ɪ', 'v', 'ʊ']
IPA_DICT = {1: 'p', 2: 'b', 3: 'm', 4: 'w', 5: 'f', 6: 'v', 7: 'θ', 8: 'ð', 9: 't', 10: 'd', 11: 'n', 12: 'l', 13: 's', 14: 'z', 15: 'r', 16: 'ʃ', 17: 'ʒ',
18: 'j', 19: 'ʧ', 20: 'ʤ', 21: 'k', 22: 'g', 23: 'ŋ', 24: 'h', 25: 'i', 26: 'ɝ', 27: 'u', 28: 'ɪ', 29: 'ʊ',
30: 'e', 31: 'ə', 32: 'o', 33: 'ɛ', 34: 'ɔ', 35: 'æ', 36: 'ɑ', 37: 'aɪ', 38: 'aʊ', 39: 'ɔɪ'}

COLORS = ["#FFEB6F","#FBA06E","#8EF7FA"]

# 10 and 12 are same as the library has only one symbol for both. 12 is changed from ʌ -> ə

"""
d = {1: 'p', 2: 'b', 3: 'm', 4: 'w', 5: 'f', 6: 'v', 7: 'θ', 8: 'ð', 9: 't', 10: 'd', 11: 'n', 12: 'l', 13: 's', 14: 'z', 15: 'r', 16: 'ʃ', 17: 'ʒ',
18: 'j', 19: 'ʧ', 20: 'ʤ', 21: 'k', 22: 'g', 23: 'ŋ', 24: 'h', 25: 'i', 26: 'ɝ', 27: 'u', 28: 'ɪ', 29: 'ʊ',
30: 'e', 31: 'ə', 32: 'o', 33: 'ɛ', 34: 'ɔ', 35: 'æ', 36: 'ɔ', 37: 'aɪ', 38: 'aʊ', 39: 'ɔɪ'}

words = ['<p/>ay', '<b/>e', '<m/>ay', '<w/>e', '<f/>ee', '<v/>ow', '<th/>ank', '<th/>ey', '<t/>oo', '<d/>o', '<n/>o', '<l/>ie', '<s/>ee', '<z/>oo', '<r/>ay', '<sh/>e', 'vi<si/>on', '<y/>ou', '<ch/>ew', '<j/>aw', '<k/>ey', '<g/>o', 'si<ng/>', '<h/>e', '<e/>at', '<ea/>rn', 'wh<o/>', '<i/>t', 'sh<ou/>ld', '<a/>te', '<uh/>', '<o/>we', '<E/>d', '<a/>we', '<a/>t', '<o/>ff', '<I/>', '<ou/>t', 'b<o/>y']

for i in d.keys():
    word = words[i-1].replace('<','<b>')
    word = word.replace('/>','</b>')
    s = '<b class="phoneme">/ ' + d[i] +" /</b>  :  " + word
    print(s)

"""
